import numpy as np

# CSV 읽기
data = np.genfromtxt(
    './crime_time.csv',
    delimiter=',',
    skip_header=1,
    encoding="utf-8"
)
print(f"{data.shape}")

시간대 = np.array([
    '0_3시', '3_6시', '6_9시', '9_12시',
    '12_15시', '15_18시', '18_21시', '21_24시'
])

#1.강력범죄
#1-1.시간별 합계
강력시간별합계 = []
for col in range(2, 10):
    합계 = np.sum(data[0:8, col].astype(int))
    강력시간별합계.append(합계)
강력시간별합계 = np.array(강력시간별합계)
print("시간대별 합계:", 강력시간별합계)

강력최다시간 = np.max(강력시간별합계)
print("최다 범죄 발생 시간대 범죄건수:",강력최다시간)

#1-2.시간별 평균
강력시간별평균=강력시간별합계//8
print("강력범죄 시간대별 평균:", 강력시간별평균)

#2. 전체 시간대 평균 비교 그룹화
print("강력범죄 위험 시간대:", 강력시간별평균>np.mean(강력시간별평균))

#3. 위기/효율 지수
# 지표 A: 시간대별 범죄 건수 배열
지표A = 강력시간별합계
# 지표 B: 전체 시간대의 평균 범죄 건수
지표B = np.mean(강력시간별합계)
print(지표B)
# 집중 관리 지수 배열
집중관리지수 = 지표A / 지표B
print("집중 관리 지수:", 집중관리지수)

# 지수가 가장 높은 위치와 해당 시간대
최고위치 = np.argmax(집중관리지수)
print("집중 관리 대상 시간대:", 시간대[최고위치])
print("최고 집중 관리 지수:", 집중관리지수[최고위치])

